# IsSystemsEnabled Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..IsSystemsEnabled Property
Application Class See Also
---
Checks whether or not any systems disciplines (mechanical, electrical, or piping) are enabled.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsSystemsEnabled { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsSystemsEnabled As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsSystemsEnabled {
	bool get ();
}
```

# See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace